[
  {
    "name": "Megan Wyn Owen",
    "city": "Cardiff",
    "country": "United Kingdom",
    "organisation": "EDF UK",
    "jobTitle": "Fuel and Reactor Physics Research Engineer",
    "degrees": [
      "BEng Electronic Engineering (2013)",
      "PhD Nuclear Science and Engineering (2019)"
    ],
    "about": [
      "After finishing my PhD at Bangor University, I pursued a Postdoctoral Research Associate position at Imperial College London researching nuclear materials. I then moved onto my current role, where I now work at EDF UK as a Fuel and Reactor Physics Research Engineer within the Nuclear R&D team.",
      "My experiences at Bangor were invaluable - from being able to volunteer in outreach events with the school and taking part in open days, to travelling to Hawaii with my research group to present at international conferences. I had full support during the 6 years I was at Bangor and felt fully equipped to move into the world of work.",
      "My advice to students coming to Bangor would be to enjoy it! 3 or 4 years go so fast, so make the most of every opportunity you are given. Get involved with the school's open day, or other extra-curricular events - it is a great way to meet more people and develop your interpersonal skills while studying."
    ],
    "lat": 51.498927,
    "lng": -3.200586,
    "altitude": 0.4,
    "focusTime": 30000,
    "transitionTime": 2500,
    "avatar": "megan-wyn-owen.png"
  },
  {
    "name": "André Mugliett",
    "city": "Kirkop",
    "country": "Malta",
    "organisation": "STMicroelectronics",
    "degrees": ["BSc Electronic Engineering (2019)"],
    "jobTitle": "Senior Project Engineer",
    "about": [
      "Tasked with managing projects within a semiconductor manufacturing site mainly focusing on R&D, automation and industry 4.0 deployment.",
      "While at Bangor, the support I received from many lecturers was phenomenal. In particular Prof. Iestyn Pierce was absolutely adamant in making sure his students were given the support and tools to succeed, both on a technical level but more importantly on a human level. He was always ready to help, and was always happy to take the time to individually sit with students who asked for his help. Not only is the campus and Bangor itself beautiful, but also the staff truly do bring a sense of care and understanding to the university and the students therein.",
      "Do not be afraid to ask for help, whether it be in studies or in your personal life. In addition to that, don't focus on others' accomplishments, focus simply on being better than you were yesterday, everyone is on a different journey."
    ],
    "lat": 35.847512,
    "lng": 14.484708,
    "altitude": 0.75,
    "focusTime": 30000,
    "transitionTime": 2500,
    "avatar": "andre-mugliett.png"
  },
  {
    "name": "Francis Williams",
    "city": "Brandenburg",
    "country": "Germany",
    "organisation": "ExaDev (Sourcepulp Ltd.)",
    "degrees": ["MSc Computing & Internet System (2011)"],
    "jobTitle": "CTO/Co-founder/Principal Consultant",
    "about": [
      "A truly full-stack developer with extensive experience in the Fintech sector, Francis has a 12 year track record as a technical consultant for agile SMEs, institutions and startups like Bee Robotics, Rothamsted Research, Bangor University, VibePay and ClearStake.",
      "Francis has held CTO-level positions for clients, architected cloud platforms and infrastructure and led service delivery teams in backend, frontend web and mobile."
    ],
    "lat": 52.638291,
    "lng": 13.044412,
    "altitude": 0.55,
    "focusTime": 30000,
    "transitionTime": 2500,
    "avatar": "francis-williams.png"
  },
  {
    "name": "Delvin Varghese",
    "city": "Melbourne",
    "country": "Australia",
    "organisation": "Action Lab, Monash University",
    "degrees": ["BSc Computer Science (2014)", "MSc Computer Science (2015)"],
    "jobTitle": "Lecturer (Technology and Design for Nonprofits)",
    "about": [
      "I work with nonprofits in Australia and abroad who are committed to empowering local communities. Typically these organisations work in what is called the humanitarian, International development or community development sector.",
      "I am a technologist by background and recently finished a PhD where I reflected on my consulting and project management experiences developing low-cost and accessible audio and video technologies."
    ],
    "lat": -37.820015,
    "lng": 145.035078,
    "altitude": 0.75,
    "focusTime": 30000,
    "transitionTime": 2500,
    "avatar": "delvin-varghese.png"
  },
  {
    "name": "Truly Capell",
    "city": "London",
    "country": "United Kingdom",
    "organisation": "Capgemini Invent",
    "degrees": ["BEng Computer Systems Engineering (2019)"],
    "jobTitle": "Senior User Research Consultant",
    "about": [
      "I'm a Senior User Research consultant, my job consists of user centred problem solving to create digital services and products that meet User needs. Which is a fancy way of saying, I collect data from multiple sources, analyse it and create insights and recommendations so that we create digital services that people really need.",
      "My degree really equipped me to think about problems holistically as well as diving into the nitty gritty detail, the analytic approach instilled in you allows you to consider multiple and intertwined problems, which now is an environment I thrive in."
    ],
    "lat": 51.502277,
    "lng": 0,
    "altitude": 0.4,
    "focusTime": 30000,
    "transitionTime": 2500,
    "avatar": "truly-capell.png"
  },
  {
    "name": "Aeron Jones",
    "city": "Thuwal",
    "country": "Saudi Arabia",
    "organisation": "King Abdullah University of Science and Technology (KAUST)",
    "degrees": [
      "BEng Electronic Engineering (2018)",
      "MScRes Electronic Engineering (2020)"
    ],
    "jobTitle": "PhD Student",
    "about": [
      "During my time at Bangor, I was under the supervision of Professor Chris Hancock. I was very fortunate to have worked with him on real world medical device applications such as a miniature endoscope to diagnose and treat lung cancer. After graduating, I was able to work at Chris's company, Creo Medical, where I continued my work on medical devices as an R&D engineer and was able to achieve a few patents. This set me up well for my next adventure where I have decided to pursue my PhD at King Abdullah University of Science and Technology (KAUST) in Saudi Arabia.",
      "My time at Bangor was very enjoyable and I could not have wished for a better experience. The close relationships that I developed with all the Professors at Bangor will always be cherished. All the staff at Bangor are approachable and their doors are genuinely always open to hear your concerns of if you just fancy a chat.",
      "My advice to students would be don't hesitate to join Bangor as you will always feel welcomed and supported by everyone at the university. The time will pass by quicker than you think and soon enough you'll find yourself in places you could never imagine."
    ],
    "lat": 22.309668,
    "lng": 39.105285,
    "altitude": 0.75,
    "focusTime": 30000,
    "transitionTime": 2500,
    "avatar": "aeron-jones.png"
  },
  {
    "name": "Cai Williams",
    "city": "Chemnitz",
    "country": "Germany",
    "organisation": "Technische Universität Chemnitz",
    "degrees": ["MEng Electronic Engineering (2019)"],
    "jobTitle": "Postdoctoral Research Assistant",
    "about": [
      "Currently working as a Postdoctoral Research Assistant within a Germany wide research consortium. I am researching how to apply machine learning in order to develop the next generation of fully printed organic photovoltaics. My role is mainly concentrated on enabling the rapid comprehensive characterisation of organic solar cells using machine learning through combining simple characterisations and simulation. Beyond research, my role has me managing small projects, such as furthering our experimental setups or organising development events for PhDs within the research consortium.",
      "While I have many highlights from my time at Bangor, one that stands out for me is the MEng project I was lucky enough to be a part of. Building showcases of how the UN's sustainable development goals could be applied to an urban space. While not a typical engineering project, the opportunity to work in an interdisciplinary team has influenced much of my work since.",
      "My advice to students is that if you go to lectures, you'll likely be fine, and if you're not fine, don't be afraid to ask questions"
    ],
    "lat": 50.840081185288284,
    "lng": 12.927950333827216,
    "altitude": 0.55,
    "focusTime": 30000,
    "transitionTime": 2500,
    "avatar": "cai-williams.png"
  },
  {
    "name": "Daniel Evans",
    "city": "Old Colwyn",
    "country": "UK",
    "organisation": "North Wales Fire and Rescue Service",
    "degrees": ["BSc Computer Information Systems (2022)"],
    "jobTitle": "Data Analyst",
    "about": [
      "Studying Computer Information Systems at Bangor provided me with a number of skills, allowing me to secure a great role conducting data analysis for North Wales Fire and Rescue Service. My advice to any student would be to take advantage of the university's internship scheme, as it provides a great insight into the world of work, and can unlock many exciting opportunities."
    ],
    "lat": 53.288572,
    "lng": -3.693926,
    "altitude": 0.4,
    "focusTime": 15000,
    "transitionTime": 2500,
    "avatar": "daniel-evans.png"
  },
  {
    "name": "Yann Bussard",
    "city": "Madrid",
    "country": "Spain",
    "organisation": "Dinycon Systems",
    "degrees": [
      "MEng Electronics Engineering (2001)",
      "MPhil Information Systems (2007)"
    ],
    "jobTitle": "Managing Director",
    "about": [
      "I am currently the Managing Director of Dinycon Systems, an engineering and integration company that specialises in mobility solutions for smart cities. I am an executive director and run the day-to-day management of the business from the Madrid office.",
      "I spent the first 13 years of my career in the UK working in software engineering and project management for the Industrial, Rail, and Aerospace industries before moving to Mexico in 2014. There I changed paths into sales and marketing, initially for the Oil & Gas industry and then for the wholesale distribution market of surveillance products. In 2017, whilst still in Mexico, I decided to start my own consultancy firm which I successfully ran up to 2021 when I decided to move back to Europe. I lead several departments, devising winning commercial strategies and managing customer contracts.",
      "Sometimes we underestimate the importance of starting one's professional career from a good foundation, but it's absolutely true if only to give you the confidence to challenge yourself and keep pushing the boundaries. I consider myself privileged for having been taught by excellent academics such as Prof. Martin Taylor, Prof. Iestyn Pierce, Mr. Alwyn Owen and so many others in the school who were (and always will be) truly inspirational and a guiding light. I have nothing but gratitude for how welcoming and helpful all members of staff were. I had the best time of my life during at Bangor. "
    ],
    "lat": 40.419985,
    "lng": -3.688795,
    "altitude": 0.55,
    "focusTime": 30000,
    "transitionTime": 2500,
    "avatar": "yann-bussard.png"
  },
  {
    "name": "Rhys Davies",
    "city": "Tabuk",
    "country": "Saudi Arabia",
    "organisation": "NEOM",
    "degrees": [
      "BEng Electronics Engineering (1990)",
      "MEng Electronics Engineering (1991)"
    ],
    "jobTitle": "Asset Management Lead for THE LINE",
    "about": [
      "My role on the world's largest project, NEOM has many facets but the 3 main ones are: 1. Influencing the design of THE LINE so it is operable and maintainable; 2. Designing the information model and information requirements so that the future operator/maintainer has what they need to be effective; 3. developing early lifecycle plans so we are ready to operate when we take over THE LINE",
      "In the late 1980s it was still a relatively small university of circa 2-3000 students. I really enjoyed the collegiate nature of the university and the town. I also spent many weekends enjoying the mountains, rivers and coasts of North Wales.",
      "A piece of career advice I didn't receive until too late in my career is to grow your network wide and deep. It doesn't matter which disciplines or organizations people are from, all connections are good connections. Just do it!"
    ],
    "lat": 28.383129,
    "lng": 36.568966,
    "altitude": 0.55,
    "focusTime": 30000,
    "transitionTime": 2500,
    "avatar": "rhys-davies.png"
  },
  {
    "name": "John Davey",
    "city": "Ottawa",
    "country": "Canada",
    "organisation": "The Standards Council of Canada",
    "degrees": ["BSc Electronics Engineering (1987)"],
    "jobTitle": "Program Manager and Assessor",
    "about": [
      "I conduct accreditation assessments of certification and inspection bodies to ISO standards. My areas of expertise are management systems (ISO/IEC 17021-1 - ISO 9001, 13485, 27001, 27701, 42001), product certification (ISO/IEC 17065 - electrical, IT), inspection (ISO/IEC 17020 - electronic and medical electronics).",
      "My highlight of my time in Bangor was the great outdoors! If I had any advice for current or prospective students it would be to take your time, enjoy Bangor!"
    ],
    "lat": 45.334753,
    "lng": -75.701724,
    "altitude": 0.55,
    "focusTime": 20000,
    "transitionTime": 2500,
    "avatar": "john-davey.png"
  },
  {
    "name": "Jonathan Hannay",
    "city": "Pittsburgh",
    "country": "USA",
    "organisation": "Naval Nuclear Laboratory",
    "degrees": [
      "MEng Electronic Engineering (1997)",
      "PhD Computational Physics (2002)"
    ],
    "jobTitle": "Principal Scientific Computing Engineer",
    "about": [
      "In my role, I specialize in fuel performance modeling and nuclear core materials engineering, where I focus on developing and analyzing the materials used within nuclear reactors to ensure their safety, efficiency, and longevity. I employ advanced computational methods and engage in scientific software development to create sophisticated simulation tools that predict how these materials behave under various operational conditions. Utilizing high-performance computing, I conduct complex numerical analyses and optimization processes to enhance reactor performance and extend the lifespan of core components.",
      "My highlights of Bangor include: St Mary's bar, Friddoedd bar, Student Union, Castle, The Globe, Belle Vue, Greek Taverna, Fat Cat, White Lion, The Skerries, and Octagon. The beautiful location. Friendly people.",
      "Remember, professors are people too! They've been in your shoes and understand the challenges of student life. Building a good rapport can lead to mentorship opportunities, valuable advice, and maybe even some hilarious stories to share at reunions.  Stay curious, stay connected, and learn by doing!",
      "While navigating student life with humour and resilience is essential, never forget that Bangor has been diligently preparing you to step into industry with the skills, confidence, and ability to make a meaningful impact. Embrace your inner superhero and take on the world with the solid foundation you've built!"
    ],
    "lat": 40.442626,
    "lng": -79.980657,
    "altitude": 0.55,
    "focusTime": 30000,
    "transitionTime": 2500,
    "avatar": "jonathan-hannay.png"
  },
  {
    "name": "Colin Dalton",
    "city": "Calgary",
    "country": "Canada",
    "organisation": "University of Calgary",
    "degrees": [
      "BEng (Hons) Electronic Engineering (1994)",
      "MSc Electronic Engineering (1998)",
      "PhD Electronic Engineering (2002)"
    ],
    "jobTitle": "Associate Head, Dept of Electrical and Software Engineering",
    "about": [
      "I am an Associate Professor performing biomedical engineering research. Associate Dept Head of Graduate studies, responsible for ~230 MSc and PhD thesis students and ~250 M.Eng students.",
      "Performing research in my final year led me into me to return for an MSc and then a PhD. Research was not why I did my undergraduate degree and it changed my direction.",
      "My advice to current and prospective students is to take risks and get outside your comfort zone, try new things, get involved in groups."
    ],
    "lat": 51.046421,
    "lng": -114.069526,
    "altitude": 0.55,
    "focusTime": 30000,
    "transitionTime": 2500,
    "avatar": "colin-dalton.png"
  },
  {
    "name": "Abdullah Almahous",
    "city": "Kuwait City",
    "country": "Kuwait",
    "organisation": "Warba Bank",
    "degrees": [
      "BEng Computing Systems Engineering (2017)",
      "MSc Electronic Engineering (2018)"
    ],
    "jobTitle": "Manager Strategic Execution",
    "about": [
      "Communicate the corporate strategy, targets, and initiatives across all channels, while collaborating with HR to incorporate strategy management education into training programs. Oversee cross-unit strategic initiatives, ensuring they receive the necessary resources and attention, while closely tracking their progress. Support the corporate IT team with key projects and drive digital transformation across the organization to enhance efficiency and innovation.",
      "Studying at Bangor University was a transformative journey filled with growth, discovery, and unforgettable memories. From late-night study sessions to exploring the stunning Welsh landscapes, student life was both challenging and rewarding. I was fortunate to co-found a society for Kuwaiti students, creating a vibrant space for cultural exchange, support, and friendship.",
      "Seize every opportunity to learn, grow, and connect. Your time as a student is a unique chapter to shape your future and discover your potential. Build relationships, take on challenges with confidence, and trust that your hard work and determination will lead you to success.",
      "Thanks Bangor University for providing an environment that supported my growth and learning. To all students, enjoy your time here."
    ],
    "lat": 29.375822,
    "lng": 47.975833,
    "altitude": 0.55,
    "focusTime": 30000,
    "transitionTime": 2500,
    "avatar": "abdullah-almahous.png"
  },
  {
    "name": "Jason Meredith",
    "city": "Zurich",
    "country": "Switzerland",
    "organisation": "Tecan Switzerland AG",
    "degrees": ["BSc Computer Systems Engineering (1989)"],
    "jobTitle": "Head of Software Product Management",
    "about": [
      "I manage a team of software product managers who in turn are responsible for the software that controls our lab automation and clinical diagnostic products. We work closely with our customers, software development and quality assurance teams to bring leading software solutions to market",
      "My highlight of my time in Bangor include managing to get a good degree and having the time of my life climbing and partying. Built a strong network of friends in North Wales.",
      "I had no idea how much hard work engineering would be, but also how rewarding it is to work with super intelligent people from all around the world."
    ],
    "lat": 47.383835,
    "lng": 8.533907,
    "altitude": 0.55,
    "focusTime": 30000,
    "transitionTime": 2500,
    "avatar": "jason-meredith.png"
  },
  {
    "name": "Olivia Kavanagh",
    "city": "Greater Manchester",
    "country": "United Kingdom",
    "organisation": "Xaverian College",
    "degrees": ["BSc Product Design (2018)"],
    "jobTitle": "Marketing and Schools Liaison Manager",
    "about": [
      "I am responsible for designing and implementing innovative strategies to support student recruitment. Day to day I oversee all marketing activities including website development, social media and press, graphic design, events and much more.",
      "Meeting some lifelong friends was the ultimate highlight of my time in Bangor, however work placements and the Design Conference were incredibly insightful and impactful. Having the opportunity to engage with other designers and listen to their career journey was always really inspiring, and I secured jobs from networking!",
      "Work hard and say yes to every experience!"
    ],
    "lat": 53.47874,
    "lng": -2.243662,
    "altitude": 0.55,
    "focusTime": 30000,
    "transitionTime": 2500,
    "avatar": "olivia-kavanagh.png"
  }
]
